benchmark/result_info.txt
Phase started: unnamed (index: 0, duration: 1s) 17:47:58(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 17:47:59(-0300)

--------------------------------------
Metrics for period to: 17:48:00(-0300) (width: 1.693s)
--------------------------------------

http.codes.200: ................................................................ 168
http.request_rate: ............................................................. 115/sec
http.requests: ................................................................. 188
http.response_time:
  min: ......................................................................... 36
  max: ......................................................................... 290
  median: ...................................................................... 141.2
  p95: ......................................................................... 190.6
  p99: ......................................................................... 210.6
http.responses: ................................................................ 168
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20


--------------------------------------
Metrics for period to: 17:48:10(-0300) (width: 7.123s)
--------------------------------------

http.codes.200: ................................................................ 832
http.request_rate: ............................................................. 114/sec
http.requests: ................................................................. 812
http.response_time:
  min: ......................................................................... 10
  max: ......................................................................... 260
  median: ...................................................................... 165.7
  p95: ......................................................................... 210.6
  p99: ......................................................................... 247.2
http.responses: ................................................................ 832
vusers.completed: .............................................................. 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 7586.2
  max: ......................................................................... 8124.9
  median: ...................................................................... 8024.5
  p95: ......................................................................... 8024.5
  p99: ......................................................................... 8024.5


All VUs finished. Total time: 10 seconds

--------------------------------
Summary report @ 17:48:09(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 115/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 10
  max: ......................................................................... 290
  median: ...................................................................... 165.7
  p95: ......................................................................... 206.5
  p99: ......................................................................... 247.2
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 7586.2
  max: ......................................................................... 8124.9
  median: ...................................................................... 8024.5
  p95: ......................................................................... 8024.5
  p99: ......................................................................... 8024.5